In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Query the survived people names and their gender

In [13]:
survived=df.loc[df['Survived']==1,['Name','Sex']]
survived.head()

                                                Name     Sex
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
9                Nasser, Mrs. Nicholas (Adele Achem)  female

Question 1: What percentage of passengers survived?

In [9]:
total_count=len(df)
survived_count=(df['Survived']==1).sum()
dead_count=total_count-survived_count
survived_percent= (survived_count/total_count)*100
dead_percent=(dead_count/total_count)*100
print(f"Total count:{total_count}")
print(f"survived: {survived_count} ({survived_percent:.1f}%)")
print(f"dead: {dead_count} ({dead_percent:.1f}%)")

Total count:891
survived: 342 (38.4%)
dead: 549 (61.6%)

 Question 2: How many men vs women survived?

In [48]:
total_men=(df['Sex']=='male').sum()
total_women=(df['Sex']=='female').sum()
total_men_survived=((df['Sex']=='male') & (df['Survived']==1)).sum()
total_women_survived=((df['Sex']=='female') & (df['Survived']==1)).sum()
print(f"Men survived: {total_men_survived}/{total_men}")
print(f"Women survived: {total_women_survived}/{total_women}")

Men survived: 109/577
Women survived: 233/314

Question 3: What was the survival rate by passenger class (1st, 2nd, 3rd)?

In [82]:
first_class_count=((df['Survived']==1) & (df['Pclass']==1)).sum()
first_srate=(first_class_count/(len(df[df['Pclass']==1])))*100
second_class_count=((df['Survived']==1) & (df['Pclass']==2)).sum()
second_srate=(second_class_count/len(df[df['Pclass']==2]))*100
third_class_count=((df['Survived']==1) & (df['Pclass']==3)).sum()
third_srate=(third_class_count/len(df[df['Pclass']==3]))*100
print(f"Survival_rate of 1st class: {first_srate:.1f}%")
print(f"Survival_rate of 2nd class: {second_srate:.1f}%")
print(f"Survival_rate of 3rd class: {third_srate:.1f}%")

Survival_rate of 1st class: 63.0%
Survival_rate of 2nd class: 47.3%
Survival_rate of 3rd class: 24.2%

Question 4: What's the average age of survivors vs non-survivors?

In [ ]:
age_live=df[df['Survived']==1]['Age'].mean()
age_dead=df[df['Survived']==0]['Age'].mean()
print(f"Average age of Survivors: {age_live:.2f}")
print(f"Average age of Non-Survivors: {age_dead:.2f}")

Average age of Survivors: 28.34
Average age of Non-Survivors: 30.63

In [14]:
import sqlite3
conn=sqlite3.connect('titanic.db')

In [7]:
df.to_sql('titanic_tb',conn,if_exists='replace',index=False)

891

In [8]:
cur=conn.cursor()
for row in cur.execute('select * from titanic_tb limit 5'):
    print(row)
conn.close()

(1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171', 7.25, None, 'S')
(2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C')
(3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26.0, 0, 0, 'STON/O2. 3101282', 7.925, None, 'S')
(4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female', 35.0, 1, 0, '113803', 53.1, 'C123', 'S')
(5, 0, 3, 'Allen, Mr. William Henry', 'male', 35.0, 0, 0, '373450', 8.05, None, 'S')

## Phase 2: SQL Analytical Queries

**Goal:** Answer key questions about the Titanic dataset using SQL

### Questions to Answer:

1. **Overall Survival Rate**
   - How many passengers survived vs died?
   - What percentage survived?

2. **Survival by Passenger Class**
   - Which class (1st, 2nd, 3rd) had the best survival rate?
   - Compare survival counts and percentages across classes

3. **Survival by Gender**
   - How did survival rates differ between male and female passengers?
   - Calculate survival percentage for each gender

4. **Age Analysis**
   - What was the average age of survivors vs non-survivors?
   - Any patterns in age distribution?

### Bonus Challenges (Optional):
- Survival rate by embarkation port (C, Q, S)
- Survival rate by age groups (child, adult, elderly)
- Combination analysis (e.g., survival by class AND gender)

In [19]:
result=pd.read_sql("select sum(Survived) as survivors, count(*)-sum(Survived) as dead,count(*) as total"
", (sum(Survived)*1.0/count(*))*100 as survival_rate from titanic_tb ",conn)
print(result)

   survivors  dead  total  survival_rate
0        342   549    891      38.383838